---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius
source: html/63b83dd6-19da-6013-24d2-c58b8d2881f5.htm
---
# RebarShapeConstraint180DegreeBendRadius Methods

Return the Id of the parameter associated with this constraint.